docker-final/docker-redis/context/lasttest/redis_benchmark_results.txt
====== SET ======
  200000 requests completed in 3.09 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.423 milliseconds (cumulative count 105112)
75.000% <= 0.487 milliseconds (cumulative count 152309)
87.500% <= 0.551 milliseconds (cumulative count 175366)
93.750% <= 0.631 milliseconds (cumulative count 188119)
96.875% <= 0.751 milliseconds (cumulative count 193789)
98.438% <= 0.919 milliseconds (cumulative count 196949)
99.219% <= 1.079 milliseconds (cumulative count 198464)
99.609% <= 1.279 milliseconds (cumulative count 199237)
99.805% <= 1.487 milliseconds (cumulative count 199625)
99.902% <= 1.703 milliseconds (cumulative count 199807)
99.951% <= 1.927 milliseconds (cumulative count 199906)
99.976% <= 3.879 milliseconds (cumulative count 199952)
99.988% <= 9.727 milliseconds (cumulative count 199976)
99.994% <= 9.775 milliseconds (cumulative count 199988)
99.997% <= 9.807 milliseconds (cumulative count 199996)
99.998% <= 9.831 milliseconds (cumulative count 199997)
99.999% <= 9.847 milliseconds (cumulative count 200000)
100.000% <= 9.847 milliseconds (cumulative count 200000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.048% <= 0.207 milliseconds (cumulative count 96)
8.886% <= 0.303 milliseconds (cumulative count 17773)
43.349% <= 0.407 milliseconds (cumulative count 86699)
79.624% <= 0.503 milliseconds (cumulative count 159249)
92.844% <= 0.607 milliseconds (cumulative count 185687)
96.154% <= 0.703 milliseconds (cumulative count 192309)
97.552% <= 0.807 milliseconds (cumulative count 195105)
98.368% <= 0.903 milliseconds (cumulative count 196737)
98.974% <= 1.007 milliseconds (cumulative count 197949)
99.299% <= 1.103 milliseconds (cumulative count 198599)
99.514% <= 1.207 milliseconds (cumulative count 199028)
99.645% <= 1.303 milliseconds (cumulative count 199291)
99.743% <= 1.407 milliseconds (cumulative count 199485)
99.823% <= 1.503 milliseconds (cumulative count 199647)
99.874% <= 1.607 milliseconds (cumulative count 199749)
99.903% <= 1.703 milliseconds (cumulative count 199807)
99.933% <= 1.807 milliseconds (cumulative count 199866)
99.948% <= 1.903 milliseconds (cumulative count 199896)
99.964% <= 2.007 milliseconds (cumulative count 199927)
99.968% <= 2.103 milliseconds (cumulative count 199935)
99.969% <= 3.103 milliseconds (cumulative count 199938)
99.986% <= 4.103 milliseconds (cumulative count 199971)
100.000% <= 10.103 milliseconds (cumulative count 200000)

Summary:
  throughput summary: 64641.24 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.445     0.136     0.423     0.663     1.015     9.847
====== GET ======
  200000 requests completed in 3.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 3)
50.000% <= 0.479 milliseconds (cumulative count 102690)
75.000% <= 0.559 milliseconds (cumulative count 152040)
87.500% <= 0.671 milliseconds (cumulative count 175675)
93.750% <= 0.791 milliseconds (cumulative count 187731)
96.875% <= 1.023 milliseconds (cumulative count 193755)
98.438% <= 1.407 milliseconds (cumulative count 196898)
99.219% <= 1.975 milliseconds (cumulative count 198443)
99.609% <= 3.327 milliseconds (cumulative count 199219)
99.805% <= 6.927 milliseconds (cumulative count 199610)
99.902% <= 9.263 milliseconds (cumulative count 199805)
99.951% <= 10.799 milliseconds (cumulative count 199903)
99.976% <= 11.935 milliseconds (cumulative count 199952)
99.988% <= 12.399 milliseconds (cumulative count 199977)
99.994% <= 12.687 milliseconds (cumulative count 199988)
99.997% <= 12.943 milliseconds (cumulative count 199994)
99.998% <= 12.999 milliseconds (cumulative count 199997)
99.999% <= 13.303 milliseconds (cumulative count 199999)
100.000% <= 16.447 milliseconds (cumulative count 200000)
100.000% <= 16.447 milliseconds (cumulative count 200000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.083% <= 0.207 milliseconds (cumulative count 165)
16.094% <= 0.303 milliseconds (cumulative count 32188)
29.125% <= 0.407 milliseconds (cumulative count 58251)
61.207% <= 0.503 milliseconds (cumulative count 122414)
82.184% <= 0.607 milliseconds (cumulative count 164369)
90.076% <= 0.703 milliseconds (cumulative count 180152)
94.277% <= 0.807 milliseconds (cumulative count 188554)
95.856% <= 0.903 milliseconds (cumulative count 191712)
96.762% <= 1.007 milliseconds (cumulative count 193524)
97.348% <= 1.103 milliseconds (cumulative count 194696)
97.831% <= 1.207 milliseconds (cumulative count 195662)
98.181% <= 1.303 milliseconds (cumulative count 196363)
98.449% <= 1.407 milliseconds (cumulative count 196898)
98.661% <= 1.503 milliseconds (cumulative count 197322)
98.852% <= 1.607 milliseconds (cumulative count 197705)
99.011% <= 1.703 milliseconds (cumulative count 198021)
99.116% <= 1.807 milliseconds (cumulative count 198232)
99.164% <= 1.903 milliseconds (cumulative count 198328)
99.243% <= 2.007 milliseconds (cumulative count 198485)
99.286% <= 2.103 milliseconds (cumulative count 198572)
99.552% <= 3.103 milliseconds (cumulative count 199104)
99.674% <= 4.103 milliseconds (cumulative count 199349)
99.732% <= 5.103 milliseconds (cumulative count 199464)
99.775% <= 6.103 milliseconds (cumulative count 199549)
99.814% <= 7.103 milliseconds (cumulative count 199629)
99.855% <= 8.103 milliseconds (cumulative count 199710)
99.894% <= 9.103 milliseconds (cumulative count 199787)
99.934% <= 10.103 milliseconds (cumulative count 199868)
99.965% <= 11.103 milliseconds (cumulative count 199930)
99.983% <= 12.103 milliseconds (cumulative count 199965)
99.999% <= 13.103 milliseconds (cumulative count 199998)
99.999% <= 14.103 milliseconds (cumulative count 199999)
100.000% <= 17.103 milliseconds (cumulative count 200000)

Summary:
  throughput summary: 51177.07 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.527     0.112     0.479     0.847     1.703    16.447